---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooCloseSpacing
source: html/f2baf7f0-5379-479f-c63f-f542e8eb3631.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooCloseSpacing Property

Bars are too close together. Increase the Maximum Spacing parameter.

## Syntax (C#)
```csharp
public static FailureDefinitionId BarsTooCloseSpacing { get; }
```